{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2024-03-18T06:45:10.0823223Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime": "2024-03-18T06:45:10.0823223Z",
  "name": "Disable Copilot",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": ["0"],
  "settingCount": 1,
  "technologies": "mdm",
  "id": "0dd4b00e-a6ca-4308-9fef-8b4c02b77e9b",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "user_vendor_msft_policy_config_windowsai_turnoffwindowscopilot",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "user_vendor_msft_policy_config_windowsai_turnoffwindowscopilot_1",
          "children": []
        }
      }
    }
  ]
}
