{
  "@odata.context": "https://graph.microsoft.com/beta/$metadata#deviceManagement/configurationPolicies/$entity",
  "createdDateTime": "2023-11-12T10:26:31.9030461Z",
  "creationSource": null,
  "description": "",
  "lastModifiedDateTime": "2023-11-12T10:26:31.9030461Z",
  "name": "MSN - crapware",
  "platforms": "windows10",
  "priorityMetaData": null,
  "roleScopeTagIds": ["0"],
  "settingCount": 1,
  "technologies": "mdm",
  "id": "6c9dfdb4-a6c8-49d2-be39-9ddb19987634",
  "templateReference": {
    "templateId": "",
    "templateFamily": "none",
    "templateDisplayName": null,
    "templateDisplayVersion": null
  },
  "settings": [
    {
      "id": "0",
      "settingInstance": {
        "@odata.type": "#microsoft.graph.deviceManagementConfigurationChoiceSettingInstance",
        "settingDefinitionId": "device_vendor_msft_policy_config_newsandinterests_allownewsandinterests",
        "settingInstanceTemplateReference": null,
        "choiceSettingValue": {
          "settingValueTemplateReference": null,
          "value": "device_vendor_msft_policy_config_newsandinterests_allownewsandinterests_0",
          "children": []
        }
      }
    }
  ]
}
